[Survived] Block removal mutation
Cinema/Cinema.Domain/Primitives/AggregateRoot.cs:9:9
         private readonly IList<IDomainEvent> _events;
 
         protected AggregateRoot()
-        {
-            _events = new List<IDomainEvent>();
-        }
+        {}
 
 

[NoCoverage] Statement mutation
Cinema/Cinema.Domain/Primitives/AggregateRoot.cs:16:13
 
         public void RaiseEvent(IDomainEvent domainEvent)
         {
-            _events.Add(domainEvent);
+            ;
         }
 

[NoCoverage] Block removal mutation
Cinema/Cinema.Domain/Primitives/AggregateRoot.cs:21:9
 
 
         public IEnumerable<IDomainEvent> GetEvents()
-        {
-            return _events.ToList();
-        }
+        {}
 
         public void ClearEvents()

[NoCoverage] Statement mutation
Cinema/Cinema.Domain/Primitives/AggregateRoot.cs:27:13
 
         public void ClearEvents()
         {
-            _events.Clear();
+            ;
         }
 
