[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
Cinema/Cinema.Domain/AuditoriumDefinition/AuditoriumEntity.cs:10:13
 
     public static AuditoriumEntity Create(int Id, ICollection<Seat> seats)
     {
-        if (!seats.Any()) throw new ArgumentException($"An Auditorium should contains seats");
+        if (seats.Any()) throw new ArgumentException($"An Auditorium should contains seats");
 
         return new AuditoriumEntity
killedBy: Cinema.Domain.UnitTest.Auditorium.AuditoriumUnitTest.Create_NotAllowed; Cinema.Domain.UnitTest.Auditorium.AuditoriumUnitTest.Create; Cinema.Domain.UnitTest.Showtime.ShowtimeUnitTest.Create

[Killed] Statement mutation
Cinema/Cinema.Domain/AuditoriumDefinition/AuditoriumEntity.cs:10:27
 
     public static AuditoriumEntity Create(int Id, ICollection<Seat> seats)
     {
-        if (!seats.Any()) throw new ArgumentException($"An Auditorium should contains seats");
+        if (!seats.Any()) ;
 
         return new AuditoriumEntity
killedBy: Cinema.Domain.UnitTest.Auditorium.AuditoriumUnitTest.Create_NotAllowed
