[NoCoverage] Statement mutation
src/Cinema/Cinema.Domain/ServicesExtensions.cs:10:9
 {
     public static IServiceCollection AddDomainNotification(this IServiceCollection services)
     {
-        services.AddMediatR(cfg => cfg.RegisterServicesFromAssembly(typeof(ServicesExtensions).Assembly));
+        ;
         return services;
     }
