[NoCoverage] Block removal mutation
Cinema.Domain/Showtime/EventHandlers/PaymentAcceptedEventHandler.cs:11:5
     private readonly IShowtimesRepository _showtimesRepository;
 
     public PaymentAcceptedEventHandler(IShowtimesRepository showtimesRepository)
-    {
-        _showtimesRepository = showtimesRepository;
-    }
+    {}
 
     public async Task Handle(PaymentAccepted notification, CancellationToken cancellationToken)

[NoCoverage] Statement mutation
Cinema.Domain/Showtime/EventHandlers/PaymentAcceptedEventHandler.cs:19:9
     {
         var showtime = await _showtimesRepository.GetAsync(notification.ShowtimeId, cancellationToken);
 
-        showtime.HasBeenPurchased(notification.Seats);
+        ;
         await _showtimesRepository.SaveChangesAsync();
     }

[NoCoverage] Statement mutation
Cinema.Domain/Showtime/EventHandlers/PaymentAcceptedEventHandler.cs:20:9
         var showtime = await _showtimesRepository.GetAsync(notification.ShowtimeId, cancellationToken);
 
         showtime.HasBeenPurchased(notification.Seats);
-        await _showtimesRepository.SaveChangesAsync();
+        ;
     }
 }
