[Survived] Object initializer mutation
Cinema/Cinema.Domain/Showtime/MovieEntity.cs:13:16
 
     public static MovieEntity Create(string title, string stars, string imdbId, DateTime releaseDate)
     {
-        return new MovieEntity
-        {
-            Id = Guid.NewGuid(),
-            Title = title,
-            ImdbId = imdbId,
-            Stars = stars,
-            ReleaseDate = releaseDate
-        };
+        return new MovieEntity
+{};
     }
 

[Survived] String mutation
Cinema/Cinema.Domain/Showtime/MovieEntity.cs:24:49
     }
 
     public Guid Id { get; private set; }
-    public string Title { get; private set; } = string.Empty;
+    public string Title { get; private set; } = "Stryker was here!";
     public string ImdbId { get; private set; } = string.Empty;
     public string Stars { get; private set; } = string.Empty;
