[Killed] Statement mutation
Cinema/Cinema.Domain/Showtime/ShowtimeEntity.cs:14:33
     public static ShowtimeEntity Create(AuditoriumEntity auditorium, MovieEntity movie, DateTime sessionDate)
     {
 
-        if (auditorium == null) throw new ArgumentNullException(nameof(auditorium));
+        if (auditorium == null) ;
         if (movie == null) throw new ArgumentNullException(nameof(movie));
 
killedBy: Cinema.Domain.UnitTest.Showtime.ShowtimeUnitTest.Create_NotAllowed

[Killed] Equality mutation
Cinema/Cinema.Domain/Showtime/ShowtimeEntity.cs:14:13
     public static ShowtimeEntity Create(AuditoriumEntity auditorium, MovieEntity movie, DateTime sessionDate)
     {
 
-        if (auditorium == null) throw new ArgumentNullException(nameof(auditorium));
+        if (auditorium != null) throw new ArgumentNullException(nameof(auditorium));
         if (movie == null) throw new ArgumentNullException(nameof(movie));
 
killedBy: Cinema.Domain.UnitTest.Showtime.ShowtimeUnitTest.Create; Cinema.Domain.UnitTest.Showtime.ShowtimeUnitTest.Create_NotAllowed

[Killed] Equality mutation
Cinema/Cinema.Domain/Showtime/ShowtimeEntity.cs:15:13
     {
 
         if (auditorium == null) throw new ArgumentNullException(nameof(auditorium));
-        if (movie == null) throw new ArgumentNullException(nameof(movie));
+        if (movie != null) throw new ArgumentNullException(nameof(movie));
 
 
killedBy: Cinema.Domain.UnitTest.Showtime.ShowtimeUnitTest.Create; Cinema.Domain.UnitTest.Showtime.ShowtimeUnitTest.Create_NotAllowed

[Killed] Statement mutation
Cinema/Cinema.Domain/Showtime/ShowtimeEntity.cs:15:28
     {
 
         if (auditorium == null) throw new ArgumentNullException(nameof(auditorium));
-        if (movie == null) throw new ArgumentNullException(nameof(movie));
+        if (movie == null) ;
 
 
killedBy: Cinema.Domain.UnitTest.Showtime.ShowtimeUnitTest.Create_NotAllowed

[Survived] Object initializer mutation
Cinema/Cinema.Domain/Showtime/ShowtimeEntity.cs:19:16
 
 
         var showtimeId = Guid.NewGuid();
-        return new ShowtimeEntity
-        {
-            Id = showtimeId,
-            Movie = movie,
-            Seats = auditorium.Seats.Select(x => ShowtimeSeatEntity.Create(x, showtimeId)).ToList(),
-            AuditoriumId = auditorium.Id,
-            SessionDate = sessionDate
-        };
+        return new ShowtimeEntity
+{};
     }
 

[NoCoverage] LogicalNotExpression to un-LogicalNotExpression mutation
Cinema/Cinema.Domain/Showtime/ShowtimeEntity.cs:34:13
 
         //Contiguous for same row?
         var seatsRow = seats.First().RowNumber;
-        if (!seats.All(x => x.RowNumber == seatsRow))
+        if (seats.All(x => x.RowNumber == seatsRow))
             throw new InvalidOperationException("Just select seats from a single row");
 

[NoCoverage] Equality mutation
Cinema/Cinema.Domain/Showtime/ShowtimeEntity.cs:34:29
 
         //Contiguous for same row?
         var seatsRow = seats.First().RowNumber;
-        if (!seats.All(x => x.RowNumber == seatsRow))
+        if (!seats.All(x => x.RowNumber != seatsRow))
             throw new InvalidOperationException("Just select seats from a single row");
 

[NoCoverage] Statement mutation
Cinema/Cinema.Domain/Showtime/ShowtimeEntity.cs:35:13
         //Contiguous for same row?
         var seatsRow = seats.First().RowNumber;
         if (!seats.All(x => x.RowNumber == seatsRow))
-            throw new InvalidOperationException("Just select seats from a single row");
+            ;
 
 

[NoCoverage] Statement mutation
Cinema/Cinema.Domain/Showtime/ShowtimeEntity.cs:39:9
 
 
         var seatNumbers = seats.Select(x => x.SeatNumber).ToArray();
-        Array.Sort(seatNumbers);
+        ;
 
         for (int i = 1; i < seatNumbers.Length; i++)

[NoCoverage] Equality mutation
Cinema/Cinema.Domain/Showtime/ShowtimeEntity.cs:41:25
         var seatNumbers = seats.Select(x => x.SeatNumber).ToArray();
         Array.Sort(seatNumbers);
 
-        for (int i = 1; i < seatNumbers.Length; i++)
+        for (int i = 1; i > seatNumbers.Length; i++)
             if (seatNumbers[i] - seatNumbers[i - 1] > 1)
                 throw new InvalidOperationException("Seat numbers not contiguous");

[NoCoverage] PostIncrementExpression to PostDecrementExpression mutation
Cinema/Cinema.Domain/Showtime/ShowtimeEntity.cs:41:49
         var seatNumbers = seats.Select(x => x.SeatNumber).ToArray();
         Array.Sort(seatNumbers);
 
-        for (int i = 1; i < seatNumbers.Length; i++)
+        for (int i = 1; i < seatNumbers.Length; i--)
             if (seatNumbers[i] - seatNumbers[i - 1] > 1)
                 throw new InvalidOperationException("Seat numbers not contiguous");

[NoCoverage] Arithmetic mutation
Cinema/Cinema.Domain/Showtime/ShowtimeEntity.cs:42:17
         Array.Sort(seatNumbers);
 
         for (int i = 1; i < seatNumbers.Length; i++)
-            if (seatNumbers[i] - seatNumbers[i - 1] > 1)
+            if (seatNumbers[i] + seatNumbers[i - 1] > 1)
                 throw new InvalidOperationException("Seat numbers not contiguous");
 

[NoCoverage] Equality mutation
Cinema/Cinema.Domain/Showtime/ShowtimeEntity.cs:42:17
         Array.Sort(seatNumbers);
 
         for (int i = 1; i < seatNumbers.Length; i++)
-            if (seatNumbers[i] - seatNumbers[i - 1] > 1)
+            if (seatNumbers[i] - seatNumbers[i - 1] >= 1)
                 throw new InvalidOperationException("Seat numbers not contiguous");
 

[NoCoverage] Statement mutation
Cinema/Cinema.Domain/Showtime/ShowtimeEntity.cs:43:17
 
         for (int i = 1; i < seatNumbers.Length; i++)
             if (seatNumbers[i] - seatNumbers[i - 1] > 1)
-                throw new InvalidOperationException("Seat numbers not contiguous");
+                ;
 
 

[NoCoverage] Logical mutation
Cinema/Cinema.Domain/Showtime/ShowtimeEntity.cs:48:31
 
         foreach (var seat in seats)
         {
-            Seats.Single(x => x.Seat.RowNumber == seat.RowNumber
-                          && x.Seat.SeatNumber == seat.SeatNumber).SetReserved();
+            Seats.Single(x => x.Seat.RowNumber == seat.RowNumber
+                          || x.Seat.SeatNumber == seat.SeatNumber).SetReserved();
 
         }

[NoCoverage] Statement mutation
Cinema/Cinema.Domain/Showtime/ShowtimeEntity.cs:48:13
 
         foreach (var seat in seats)
         {
-            Seats.Single(x => x.Seat.RowNumber == seat.RowNumber
-                          && x.Seat.SeatNumber == seat.SeatNumber).SetReserved();
+            ;
 
         }

[NoCoverage] Equality mutation
Cinema/Cinema.Domain/Showtime/ShowtimeEntity.cs:49:30
         foreach (var seat in seats)
         {
             Seats.Single(x => x.Seat.RowNumber == seat.RowNumber
-                          && x.Seat.SeatNumber == seat.SeatNumber).SetReserved();
+                          && x.Seat.SeatNumber != seat.SeatNumber).SetReserved();
 
         }

[NoCoverage] Statement mutation
Cinema/Cinema.Domain/Showtime/ShowtimeEntity.cs:59:13
 
         foreach (var seat in seats)
         {
-            Seats.Single(x => x.Seat.RowNumber == seat.RowNumber
-                          && x.Seat.SeatNumber == seat.SeatNumber).SetPurchased();
+            ;
 
         }

[NoCoverage] Logical mutation
Cinema/Cinema.Domain/Showtime/ShowtimeEntity.cs:59:31
 
         foreach (var seat in seats)
         {
-            Seats.Single(x => x.Seat.RowNumber == seat.RowNumber
-                          && x.Seat.SeatNumber == seat.SeatNumber).SetPurchased();
+            Seats.Single(x => x.Seat.RowNumber == seat.RowNumber
+                          || x.Seat.SeatNumber == seat.SeatNumber).SetPurchased();
 
         }

[NoCoverage] Equality mutation
Cinema/Cinema.Domain/Showtime/ShowtimeEntity.cs:60:30
         foreach (var seat in seats)
         {
             Seats.Single(x => x.Seat.RowNumber == seat.RowNumber
-                          && x.Seat.SeatNumber == seat.SeatNumber).SetPurchased();
+                          && x.Seat.SeatNumber != seat.SeatNumber).SetPurchased();
 
         }
