[Survived] Boolean mutation
Cinema/Cinema.Domain/Showtime/ShowtimeSeatEntity.cs:16:25
             Id = Guid.NewGuid(),
             ShowtimeId = showtimeId,
             ReservationCooldown = TimeSpan.FromMinutes(DEFAULT_COOLDOWN),
-            Purchased = false,
+            Purchased = true,
             ReservationTime = null,
             Seat = seat

[NoCoverage] Negate expression
Cinema/Cinema.Domain/Showtime/ShowtimeSeatEntity.cs:25:13
 
     public void SetReserved()
     {
-        if (Purchased)
+        if (!(Purchased))
             throw new InvalidOperationException("It shouldn't be possible to reserve an already sold seat.");
 

[NoCoverage] Statement mutation
Cinema/Cinema.Domain/Showtime/ShowtimeSeatEntity.cs:26:13
     public void SetReserved()
     {
         if (Purchased)
-            throw new InvalidOperationException("It shouldn't be possible to reserve an already sold seat.");
+            ;
 
         if (ReservationTime.HasValue && DateTime.UtcNow <= ReservationTime.Value.Add(ReservationCooldown))

[NoCoverage] Equality mutation
Cinema/Cinema.Domain/Showtime/ShowtimeSeatEntity.cs:28:41
         if (Purchased)
             throw new InvalidOperationException("It shouldn't be possible to reserve an already sold seat.");
 
-        if (ReservationTime.HasValue && DateTime.UtcNow <= ReservationTime.Value.Add(ReservationCooldown))
+        if (ReservationTime.HasValue && DateTime.UtcNow > ReservationTime.Value.Add(ReservationCooldown))
             throw new InvalidOperationException($"It should not be possible to reserve the same seats two times in {DEFAULT_COOLDOWN} minutes");
 

[NoCoverage] Negate expression
Cinema/Cinema.Domain/Showtime/ShowtimeSeatEntity.cs:28:13
         if (Purchased)
             throw new InvalidOperationException("It shouldn't be possible to reserve an already sold seat.");
 
-        if (ReservationTime.HasValue && DateTime.UtcNow <= ReservationTime.Value.Add(ReservationCooldown))
+        if (!(ReservationTime.HasValue && DateTime.UtcNow <= ReservationTime.Value.Add(ReservationCooldown)))
             throw new InvalidOperationException($"It should not be possible to reserve the same seats two times in {DEFAULT_COOLDOWN} minutes");
 

[NoCoverage] Statement mutation
Cinema/Cinema.Domain/Showtime/ShowtimeSeatEntity.cs:29:13
             throw new InvalidOperationException("It shouldn't be possible to reserve an already sold seat.");
 
         if (ReservationTime.HasValue && DateTime.UtcNow <= ReservationTime.Value.Add(ReservationCooldown))
-            throw new InvalidOperationException($"It should not be possible to reserve the same seats two times in {DEFAULT_COOLDOWN} minutes");
+            ;
 
 

[NoCoverage] String mutation
Cinema/Cinema.Domain/Showtime/ShowtimeSeatEntity.cs:29:49
             throw new InvalidOperationException("It shouldn't be possible to reserve an already sold seat.");
 
         if (ReservationTime.HasValue && DateTime.UtcNow <= ReservationTime.Value.Add(ReservationCooldown))
-            throw new InvalidOperationException($"It should not be possible to reserve the same seats two times in {DEFAULT_COOLDOWN} minutes");
+            throw new InvalidOperationException($"");
 
 

[NoCoverage] Statement mutation
Cinema/Cinema.Domain/Showtime/ShowtimeSeatEntity.cs:37:24
 
     public void SetPurchased()
     {
-        if (Purchased) throw new InvalidOperationException("It is not possible to buy two times the same seat.");
+        if (Purchased) ;
         Purchased = true;
     }

[NoCoverage] Negate expression
Cinema/Cinema.Domain/Showtime/ShowtimeSeatEntity.cs:37:13
 
     public void SetPurchased()
     {
-        if (Purchased) throw new InvalidOperationException("It is not possible to buy two times the same seat.");
+        if (!(Purchased)) throw new InvalidOperationException("It is not possible to buy two times the same seat.");
         Purchased = true;
     }

[NoCoverage] Boolean mutation
Cinema/Cinema.Domain/Showtime/ShowtimeSeatEntity.cs:38:21
     public void SetPurchased()
     {
         if (Purchased) throw new InvalidOperationException("It is not possible to buy two times the same seat.");
-        Purchased = true;
+        Purchased = false;
     }
 
