[Killed] Statement mutation
Cinema/Cinema.Domain/Ticket/TicketEntity.cs:14:31
 
         public static TicketEntity Create(IEnumerable<Seat> seats, Guid showtimeId, string movieTile)
         {
-            if (!seats.Any()) throw new ArgumentException($"Invalid {seats}");
+            if (!seats.Any()) ;
 
             if (string.IsNullOrWhiteSpace(movieTile)) throw new ArgumentException($"Invalid {movieTile}");
killedBy: Cinema.Domain.UnitTest.Ticket.TicketUnitTest.CreateTicketTest_NotAllowed

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
Cinema/Cinema.Domain/Ticket/TicketEntity.cs:14:17
 
         public static TicketEntity Create(IEnumerable<Seat> seats, Guid showtimeId, string movieTile)
         {
-            if (!seats.Any()) throw new ArgumentException($"Invalid {seats}");
+            if (seats.Any()) throw new ArgumentException($"Invalid {seats}");
 
             if (string.IsNullOrWhiteSpace(movieTile)) throw new ArgumentException($"Invalid {movieTile}");
killedBy: Cinema.Domain.UnitTest.Ticket.TicketUnitTest.CreateTicketTest_NotAllowed; Cinema.Domain.UnitTest.Ticket.TicketUnitTest.CreateTicketTest

[Killed] Negate expression
Cinema/Cinema.Domain/Ticket/TicketEntity.cs:16:17
         {
             if (!seats.Any()) throw new ArgumentException($"Invalid {seats}");
 
-            if (string.IsNullOrWhiteSpace(movieTile)) throw new ArgumentException($"Invalid {movieTile}");
+            if (!(string.IsNullOrWhiteSpace(movieTile))) throw new ArgumentException($"Invalid {movieTile}");
 
             var ticket = new TicketEntity
killedBy: Cinema.Domain.UnitTest.Ticket.TicketUnitTest.CreateTicketTest

[NoCoverage] Statement mutation
Cinema/Cinema.Domain/Ticket/TicketEntity.cs:16:55
         {
             if (!seats.Any()) throw new ArgumentException($"Invalid {seats}");
 
-            if (string.IsNullOrWhiteSpace(movieTile)) throw new ArgumentException($"Invalid {movieTile}");
+            if (string.IsNullOrWhiteSpace(movieTile)) ;
 
             var ticket = new TicketEntity

[Survived] Object initializer mutation
Cinema/Cinema.Domain/Ticket/TicketEntity.cs:18:26
 
             if (string.IsNullOrWhiteSpace(movieTile)) throw new ArgumentException($"Invalid {movieTile}");
 
-            var ticket = new TicketEntity
-            {
-                Id = Guid.NewGuid(),
-                CreatedTime = DateTime.Now,
-                Paid = false,
-                Seats = seats.ToList(),
-                MovieTitle = movieTile,
-                ShowtimeId = showtimeId,
-            };
+            var ticket = new TicketEntity
+{};
 
             return ticket;

[Survived] Boolean mutation
Cinema/Cinema.Domain/Ticket/TicketEntity.cs:22:24
             {
                 Id = Guid.NewGuid(),
                 CreatedTime = DateTime.Now,
-                Paid = false,
+                Paid = true,
                 Seats = seats.ToList(),
                 MovieTitle = movieTile,

[NoCoverage] Statement mutation
Cinema/Cinema.Domain/Ticket/TicketEntity.cs:33:23
 
         public void ConfirmPayment()
         {
-            if (Paid) throw new InvalidOperationException("It's already paid.");
+            if (Paid) ;
 
             RaiseEvent(new PaymentAccepted(ShowtimeId, Seats));

[NoCoverage] Negate expression
Cinema/Cinema.Domain/Ticket/TicketEntity.cs:33:17
 
         public void ConfirmPayment()
         {
-            if (Paid) throw new InvalidOperationException("It's already paid.");
+            if (!(Paid)) throw new InvalidOperationException("It's already paid.");
 
             RaiseEvent(new PaymentAccepted(ShowtimeId, Seats));

[NoCoverage] Statement mutation
Cinema/Cinema.Domain/Ticket/TicketEntity.cs:35:13
         {
             if (Paid) throw new InvalidOperationException("It's already paid.");
 
-            RaiseEvent(new PaymentAccepted(ShowtimeId, Seats));
+            ;
 
             Paid = true;

[NoCoverage] Boolean mutation
Cinema/Cinema.Domain/Ticket/TicketEntity.cs:37:20
 
             RaiseEvent(new PaymentAccepted(ShowtimeId, Seats));
 
-            Paid = true;
+            Paid = false;
         }
 

[Survived] String mutation
Cinema/Cinema.Domain/Ticket/TicketEntity.cs:42:58
 
         public Guid Id { get; private set; }
         public Guid ShowtimeId { get; private set; }
-        public string MovieTitle { get; private set; } = string.Empty;
+        public string MovieTitle { get; private set; } = "Stryker was here!";
         public ICollection<Seat> Seats { get; private set; } = new List<Seat>();
         public DateTime CreatedTime { get; private set; }
