[Killed] Statement mutation
Cinema/Cinema.Domain/Ticket/TicketEntity.cs:14:31
 
         public static TicketEntity Create(IEnumerable<Seat> seats, Guid showtimeId, string movieTile)
         {
-            if (!seats.Any()) throw new ArgumentException($"Invalid {nameof(seats)}");
+            if (!seats.Any()) ;
 
             if (string.IsNullOrWhiteSpace(movieTile)) throw new ArgumentException($"Invalid {nameof(movieTile)}");
killedBy: Cinema.Domain.UnitTest.Ticket.TicketUnitTest.CreateTicketTest_NotAllowed

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
Cinema/Cinema.Domain/Ticket/TicketEntity.cs:14:17
 
         public static TicketEntity Create(IEnumerable<Seat> seats, Guid showtimeId, string movieTile)
         {
-            if (!seats.Any()) throw new ArgumentException($"Invalid {nameof(seats)}");
+            if (seats.Any()) throw new ArgumentException($"Invalid {nameof(seats)}");
 
             if (string.IsNullOrWhiteSpace(movieTile)) throw new ArgumentException($"Invalid {nameof(movieTile)}");
killedBy: Cinema.Domain.UnitTest.Ticket.TicketUnitTest.CreateTicketTest_NotAllowedForMovieTitle; Cinema.Domain.UnitTest.Ticket.TicketUnitTest.CreateTicketTest_NotAllowedForMovieTitle; Cinema.Domain.UnitTest.Ticket.TicketUnitTest.CreateTicketTest_NotAllowedForMovieTitle

[Killed] Negate expression
Cinema/Cinema.Domain/Ticket/TicketEntity.cs:16:17
         {
             if (!seats.Any()) throw new ArgumentException($"Invalid {nameof(seats)}");
 
-            if (string.IsNullOrWhiteSpace(movieTile)) throw new ArgumentException($"Invalid {nameof(movieTile)}");
+            if (!(string.IsNullOrWhiteSpace(movieTile))) throw new ArgumentException($"Invalid {nameof(movieTile)}");
 
             var ticket = new TicketEntity
killedBy: Cinema.Domain.UnitTest.Ticket.TicketUnitTest.CreateTicketTest_NotAllowedForMovieTitle; Cinema.Domain.UnitTest.Ticket.TicketUnitTest.CreateTicketTest_NotAllowedForMovieTitle; Cinema.Domain.UnitTest.Ticket.TicketUnitTest.CreateTicketTest_NotAllowedForMovieTitle

[Killed] Statement mutation
Cinema/Cinema.Domain/Ticket/TicketEntity.cs:16:55
         {
             if (!seats.Any()) throw new ArgumentException($"Invalid {nameof(seats)}");
 
-            if (string.IsNullOrWhiteSpace(movieTile)) throw new ArgumentException($"Invalid {nameof(movieTile)}");
+            if (string.IsNullOrWhiteSpace(movieTile)) ;
 
             var ticket = new TicketEntity
killedBy: Cinema.Domain.UnitTest.Ticket.TicketUnitTest.CreateTicketTest_NotAllowedForMovieTitle; Cinema.Domain.UnitTest.Ticket.TicketUnitTest.CreateTicketTest_NotAllowedForMovieTitle; Cinema.Domain.UnitTest.Ticket.TicketUnitTest.CreateTicketTest_NotAllowedForMovieTitle
